Revit 2027 API
RebarConstraint.IsToHostFaceOrCover Method
 Returns true if the RebarConstraintType of the RebarConstraint is either 'FixedDistanceToHostFace' or 'ToCover'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsToHostFaceOrCover()
Public Function IsToHostFaceOrCover As Boolean
public:
bool IsToHostFaceOrCover()
member IsToHostFaceOrCover : unit -> bool
Return Value
Boolean
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace